In [1]:
import sqlite3

# Display SQLite version number
print (sqlite3.sqlite_version)

3.27.2

In [2]:
conn=sqlite3.connect('S:\\GroupProject\\Group Ecommerce.db')
print(type(conn))

# The connection object (conn) has access to various methods of the Connection class. 
# We are using the method cursor() and which returns a cursor object.
# The cursor object is essential to perform any operation on the database (CRUD operations).
cur=conn.cursor()

# The next command is only for display
print(type(cur))

<class 'sqlite3.Connection'>
<class 'sqlite3.Cursor'>

In [3]:
def tables_in_sqlite_db(conn):
    cursor = conn.execute("SELECT name FROM sqlite_master WHERE type='table';")
    tables = [
        v[0] for v in cursor.fetchall()
        if v[0] != "sqlite_sequence"
    ]
    cursor.close()
    return tables

In [4]:
# call the function and pass connection object 
tables = tables_in_sqlite_db(conn)

#print tables in the current database
print(tables)

['E_WAREHOUSE', 'E_COURIER', 'E_DELIVERYINFO', 'E_ORDER', 'E_ORD_INV', 'E_INVENTORY', 'E_ORD_DEL', 'E_EMPLOYEE', 'E_CUSTOMER', 'E_BILLINGINFO']

In [67]:
#cur.execute("DROP TABLE EC_BILLINGINFO")
#print("Table dropped... ")
#conn.commit()

Table dropped...

In [6]:
qry='''
CREATE TABLE E_WAREHOUSE (
storeID INTEGER PRIMARY KEY,
storeName TEXT (30) NOT NULL,
storeAddress TEXT (40) NOT NULL,
storePhone INTEGER NOT NULL
);
'''
try:
        cur.execute(qry)
        print ('Table created successfully')
except:
# If table already exists then use the SQLite console to connect to the database (BEMM459.db) and then use the drop table command.
# .. Altenatively, use the SQLiteStudio GUI to delete table ECC_DEPARTMENT and execute this code block again.
        print ('Error in creating table')

Table created successfully

In [41]:
qry='''
CREATE TABLE E_INVENTORY (
invID INTEGER PRIMARY KEY,
invName TEXT (30) NOT NULL,
invBrand TEXT (40),
invColour TEXT (40),
invSize INTEGER NOT NULL,
invQuantity INTEGER NOT NULL,
invPackaging TEXT (40),
storeID INTEGER NOT NULL,
FOREIGN KEY (storeID) REFERENCES E_WAREHOUSE (storeID) ON UPDATE CASCADE ON DELETE SET NULL
);
'''
try:
        cur.execute(qry)
        print ('Table created successfully')
except:
# If table already exists then use the SQLite console to connect to the database (BEMM459.db) and then use the drop table command.
# .. Altenatively, use the SQLiteStudio GUI to delete table ECC_DEPARTMENT and execute this code block again.
        print ('Error in creating table')

Table created successfully

In [24]:
qry='''
CREATE TABLE E_ORDER (
orderID INTEGER PRIMARY KEY,
orderDate TEXT NOT NULL,
orderDiscInfo INTEGER,
orderComment TEXT (50),
orderStatus TEXT (50),
delID INTEGER NOT NULL,
FOREIGN KEY (delID) REFERENCES E_DELIVERYINFO (delID) ON UPDATE CASCADE ON DELETE SET NULL
);
'''
try:
        cur.execute(qry)
        print ('Table created successfully')
except:
# If table already exists then use the SQLite console to connect to the database (BEMM459.db) and then use the drop table command.
# .. Altenatively, use the SQLiteStudio GUI to delete table ECC_DEPARTMENT and execute this code block again.
        print ('Error in creating table')

Table created successfully

In [33]:
qry='''
CREATE TABLE E_ORD_INV (
orderID INTEGER NOT NULL,
invID INTEGER NOT NULL,
PRIMARY KEY (orderID, invID),
FOREIGN KEY (invID) REFERENCES E_INVENTORY (invID) ON UPDATE CASCADE ON DELETE SET NULL,
FOREIGN KEY (orderID) REFERENCES E_ORDER (orderID) ON UPDATE CASCADE ON DELETE SET NULL
);
'''
try:
        cur.execute(qry)
        print ('Table created successfully')
except:
# If table already exists then use the SQLite console to connect to the database (BEMM459.db) and then use the drop table command.
# .. Altenatively, use the SQLiteStudio GUI to delete table ECC_DEPARTMENT and execute this code block again.
        print ('Error in creating table')

Table created successfully

In [13]:
qry='''
CREATE TABLE E_CUSTOMER (
custID INTEGER PRIMARY KEY,
custName TEXT (40) NOT NULL,
custAddress TEXT (40) NOT NULL,
custEmail TEXT (40) NOT NULL,
custPhone INTEGER,
billingID INTEGER NOT NULL,
FOREIGN KEY (billingID) REFERENCES E_BILLINGINFO (billingID) ON UPDATE CASCADE ON DELETE SET NULL
);
'''
try:
        cur.execute(qry)
        print ('Table created successfully')
except:
# If table already exists then use the SQLite console to connect to the database (BEMM459.db) and then use the drop table command.
# .. Altenatively, use the SQLiteStudio GUI to delete table ECC_DEPARTMENT and execute this code block again.
        print ('Error in creating table')

Table created successfully

In [17]:
qry='''
CREATE TABLE E_DELIVERYINFO (
delID INTEGER PRIMARY KEY,
custID INTEGER,
courierID INTEGER,
FOREIGN KEY (custID) REFERENCES E_CUSTOMER (custID) ON UPDATE CASCADE ON DELETE SET NULL,
FOREIGN KEY (courierID) REFERENCES E_COURIER (courierID) ON UPDATE CASCADE ON DELETE SET NULL
);
'''
try:
        cur.execute(qry)
        print ('Table created successfully')
except:
# If table already exists then use the SQLite console to connect to the database (BEMM459.db) and then use the drop table command.
# .. Altenatively, use the SQLiteStudio GUI to delete table ECC_DEPARTMENT and execute this code block again.
        print ('Error in creating table')

Table created successfully

In [45]:
qry='''
CREATE TABLE E_ORD_DEL (
orderID INTEGER NOT NULL,
delID INTEGER NOT NULL,
PRIMARY KEY (orderID, delID),
FOREIGN KEY (delID) REFERENCES E_DELIVERYINFO (delID) ON UPDATE CASCADE ON DELETE SET NULL,
FOREIGN KEY (orderID) REFERENCES E_ORDER (orderID) ON UPDATE CASCADE ON DELETE SET NULL
);
'''
try:
        cur.execute(qry)
        print ('Table created successfully')
except:
# If table already exists then use the SQLite console to connect to the database (BEMM459.db) and then use the drop table command.
# .. Altenatively, use the SQLiteStudio GUI to delete table ECC_DEPARTMENT and execute this code block again.
        print ('Error in creating table')

Table created successfully

In [50]:
qry='''
CREATE TABLE E_EMPLOYEE (
employeeID INTEGER PRIMARY KEY,
employeeFirstName TEXT (30),
employeeLastName TEXT (30),
employeeDOB TEXT (20) NOT NULL, 
employeeType INTEGER NOT NULL, 
employeeEmail TEXT (30), 
employeeSalary INTEGER NOT NULL, 
employeeHireDate TEXT (20) NOT NULL, 
storeID INTEGER NOT NULL,
FOREIGN KEY (storeID) REFERENCES E_WAREHOUSE (storeID) ON UPDATE CASCADE ON DELETE SET NULL
);
'''
try:
        cur.execute(qry)
        print ('Table created successfully')
except:
# If table already exists then use the SQLite console to connect to the database (groupproject3.db) and then use the drop table command.
# .. Altenatively, use the SQLiteStudio GUI to delete table ECC_DEPARTMENT and execute this code block again.
        print ('Error in creating table')

Table created successfully

In [65]:
qry='''
CREATE TABLE E_BILLINGINFO (
billingID INTEGER PRIMARY KEY,
billingName TEXT (40) NOT NULL,
billingAddress TEXT (60) NOT NULL, 
billingTransaction TEXT (30) NOT NULL, 
billingDate TEXT (30)
);
'''
try:
        cur.execute(qry)
        print ('Table created successfully')
except:
# If table already exists then use the SQLite console to connect to the database (groupproject3.db) and then use the drop table command.
# .. Altenatively, use the SQLiteStudio GUI to delete table ECC_DEPARTMENT and execute this code block again.
        print ('Error in creating table')

Error in creating table

In [16]:
qry='''
CREATE TABLE E_COURIER (
courierID INTEGER PRIMARY KEY,
courierName TEXT (50) NOT NULL,
courierPhone INTEGER NOT NULL, 
courierEmail TEXT (30) NOT NULL 
);
'''
try:
        cur.execute(qry)
        print ('Table created successfully')
except:
# If table already exists then use the SQLite console to connect to the database (groupproject3.db) and then use the drop table command.
# .. Altenatively, use the SQLiteStudio GUI to delete table ECC_DEPARTMENT and execute this code block again.
        print ('Error in creating table')

Table created successfully

In [8]:
qry="insert into E_WAREHOUSE values (001, 'Hoodies Ecommerce', 'Stocker Road, Exeter, EX4 4PY', 01392661000);"

try:
        cur.execute(qry)
        conn.commit()
        print ('One record inserted successfully..commit')
except:
        print ('Error in insert operation..rollback')
        conn.rollback()
        print(conn)

One record inserted successfully..commit

In [32]:
# Insert multiple records in table E_EMPLOYEE

qry="insert into E_EMPLOYEE (employeeID, employeeFirstName, employeeLastName, employeeDOB, employeeType, employeeEmail, employeeSalary, employeeHireDate, storeID) values (?,?,?,?,?,?,?,?,?);"
valuesemployee=[(2, 'Ava', 'Green', '03.04.1995', 'Warehouse Staff', 'Ava2@hoodiesecommerce.com', 19500, '07.01.22',1),
(3, 'Isabella', 'James', '07.11.1992', 'Warehouse Staff', 'Isabella3@hoodiesecommerce.com', 21500, '08.04.21',1),
(4, 'Sophia', 'Jones', '08.04.1978', 'Warehouse Staff', 'Sophia4@hoodiesecommerce.com', 26000, '02.04.21',1),
(5, 'Alice', 'Jones', '04.12.1984', 'Warehouse Staff', 'Alice5@hoodiesecommerce.com', 21500, '09.05.21',1),
(6, 'Isla', 'Campbell', '04.05.1991', 'Warehouse Staff', 'Isla6@hoodiesecommerce.com', 21500, '08.09.21',1)]

try:
        cur.executemany(qry, valuesemployee)
        conn.commit()
        print ('Records inserted successfully..committed')
except:
        print ('Error in insert operation..rollback')
        conn.rollback()

Records inserted successfully..committed

In [34]:
# Insert multiple records in table E_EMPLOYEE

qry="insert into E_EMPLOYEE (employeeID, employeeFirstName, employeeLastName, employeeDOB, employeeType, employeeEmail, employeeSalary, employeeHireDate, storeID) values (?,?,?,?,?,?,?,?,?);"
valuesemployees=[(7, 'Ruby', 'Mitchell', '03.07.1994', 'Warehouse Staff', 'Ruby7@hoodiesecommerce.com', 26000, '02.04.21',1),
(8, 'James', 'Ross', '12.12.1973', 'Warehouse Staff', 'James8@hoodiesecommerce.com', 24000, '02.04.21',1),
(9, 'Henry', 'Clark', '14.10.1981', 'Manager', 'Henry9@hoodiesecommerce.com', 75000, '02.04.21',1),
(10, 'Oliver', 'Clarke', '13.12.1996', 'Warehouse Staff', 'Oliver10@hoodiesecommerce.com', 26000, '02.04.21',1),
(11, 'Ben', 'Smith', '23.03.1995', 'Warehouse Staff', 'Ben11@hoodiesecommerce.com', 19500, '07.01.22',1),
(12, 'Jack', 'Johnson', '14.02.1994', 'Warehouse Staff', 'Jack12@hoodiesecommerce.com', 26000, '02.04.21',1),
(13, 'Liam', 'Scott',  '17.09.1992', 'Warehouse Staff', 'Liam13@hoodiesecommerce.com', 21500, '11.11.21',1),
(14, 'Simon', 'Walker', '11.05.1977', 'Warehouse Staff', 'Simon14@hoodiesecommerce.com', 24000, '18.04.21',1),
(15, 'Noah', 'Young', '02.07.1988', 'Warehouse Staff', 'Noah15@hoodiesecommerce.com', 21500, '05.10.21',1),
(16, 'Logan', 'Pearson', '06.08.1984', 'Warehouse Staff', 'Logan16@hoodiesecommerce.com', 24000, '16.12.21',1),
(17, 'Charlie', 'Green', '31.03.1995', 'Warehouse Staff', 'Charlier17@hoodiesecommerce.com', 26000, '02.04.21',1),
(18, 'Joshua', 'Richardson', '24.02.1988', 'Warehouse Staff', 'Joshua18@hoodiesecommerce.com', 26000, '02.04.21',1),
(19, 'Grace', 'Mackay', '27.03.1987', 'Warehouse Staff', 'Grace19@hoodiesecommerce.com', 24000, '03.11.21' ,1),
(20, 'Svenja', 'Gordan', '15.04.1998', 'Warehouse Staff', 'Svenja20@hoodiesecommerce.com', 19500, '07.01.22',1),
(21, 'Maya', 'Black', '16.12.1994', 'Warehouse Staff', 'Maya21@hoodiesecommerce.com', 21500, '12.06.21',1),
(22, 'Freya', 'Brown', '17.10.1980', 'Warehouse Staff', 'Freya22@hoodiesecommerce.com', 26000, '02.04.21',1),
(23, 'Jennifer', 'Nicholson', '04.06.1979', 'Warehouse Staff', 'Jennifer23@hoodiesecommerce.com', 21500, '25.11.21' ,1),
(24, 'Michael', 'Davenport', '27.04.1988', 'Warehouse Staff', 'Michale24@hoodiesecommerce.com', 24000, '13.04.21',1),
(25, 'Richard', 'James', '28.04.1992', 'Warehouse Staff', 'Richard25@hoodiesecommerce.com', 24000, '17.07.21',1),
(26, 'Daniel',  'Henderson', '30.07.1974', 'Warehouse Staff', 'Daniel26@hoodiesecommerce.com', 26000, '02.04.21',1),
(27, 'Steven', 'Crawford', '29.02.2000', 'Warehouse Staff', 'Steven27@hoodiesecommerce.com', 24000, '05.08.21',1),
(28, 'Sally', 'Duncan', '01.01.1990', 'Warehouse Staff', 'Sally28@hoodiesecommerce.com', 26000, '02.04.21',1),
(29, 'George', 'Hill', '05.08.1994', 'Warehouse Staff', 'George29@hoodiesecommerce.com', 19500, '07.01.22',1),
(30, 'Sven', 'King', '13.11.1997', 'Warehouse Staff', 'Sven30@hoodiesecommerce.com', 26000, '02.04.21',1),
]

try:
        cur.executemany(qry, valuesemployees)
        conn.commit()
        print ('Records inserted successfully..committed')
except:
        print ('Error in insert operation..rollback')
        conn.rollback()

Records inserted successfully..committed

In [19]:
qry="insert into  E_EMPLOYEE values (1,'Olivia', 'Brown', '01.02.1997', 'Warehouse Staff',  'Olivia1@hoodiesecommerce.com', 26000, '02.04.21',1);"

try:
        cur.execute(qry)
        conn.commit()
        print ('One record inserted successfully..commit')
except:
        print ('Error in insert operation..rollback')
        conn.rollback()
        print(conn)

One record inserted successfully..commit

In [35]:
# Insert multiple records in table E_INVENTORY

qry="insert into E_INVENTORY (invID, invName, invBrand, invColour, invSize, invQuantity, invPackaging,storeID) values (?,?,?,?,?,?,?,?);"
valuesinventory=[(1, 'Navy Blue Hoodie','Munti', 'navy blue', 32, 1000, 'Recyclable Paper',1),
(2, 'Grey Hoodie', 'Munti', 'grey', 32,1000,'Recyclable Paper',1),
(3, 'Red Hoodie', 'Munti', 'red', 32,1000, 'Recyclable Paper',1),
(4, 'Olive Hoodie', 'Munti', 'olive', 32,1000, 'Recylable Paper',1),
(5, 'Pink Hoodie', 'Munti', 'pink', 32,1000, 'Recylable Paper',1),
(6, 'Purple Hoodie', 'Munti', 'purple', 32,1000, 'Recylable Paper',1),
(7, 'Black Hoodie', 'Munti', 'black', 32,1000, 'Recylable Paper',1),
(8, 'Burgundy Hoodie', 'Munti', 'burgundy', 32,1000, 'Recylable Paper',1),
(9, 'Navy Blue Hoodie','Munti', 'navy blue', 34, 1000, 'Recyclable Paper',1),
(10, 'Grey Hoodie', 'Munti', 'grey', 34,1000,'Recyclable Paper',1),
(11, 'Red Hoodie', 'Munti', 'red', 34,1000, 'Recyclable Paper',1),
(12, 'Olive Hoodie', 'Munti', 'olive', 34,1000, 'Recylable Paper',1),
(13, 'Pink Hoodie', 'Munti', 'pink', 34,1000, 'Recylable Paper',1),
(14, 'Purple Hoodie', 'Munti', 'purple', 34,1000, 'Recylable Paper',1),
(15, 'Black Hoodie', 'Munti', 'black', 34,1000, 'Recylable Paper',1),
(16, 'Burgundy Hoodie', 'Munti', 'burgundy', 34,1000, 'Recylable Paper',1),
(17, 'Navy Blue Hoodie','Munti', 'navy blue', 36, 1000, 'Recyclable Paper',1),
(18, 'Grey Hoodie', 'Munti', 'grey', 36,1000,'Recyclable Paper',1),
(19, 'Red Hoodie', 'Munti', 'red', 36,1000, 'Recyclable Paper',1),
(20, 'Olive Hoodie', 'Munti', 'olive', 36,1000, 'Recylable Paper',1),
(21, 'Pink Hoodie', 'Munti', 'pink', 36,1000, 'Recylable Paper',1),
(22, 'Purple Hoodie', 'Munti', 'purple', 36,1000, 'Recylable Paper',1),
(23, 'Black Hoodie', 'Munti', 'black', 36,1000, 'Recylable Paper',1),
(24, 'Burgundy Hoodie', 'Munti', 'burgundy', 36,1000, 'Recylable Paper',1),
(25, 'Navy Blue Hoodie','Munti', 'navy blue', 38, 1000, 'Recyclable Paper',1),
(26, 'Grey Hoodie', 'Munti', 'grey', 38,1000,'Recyclable Paper',1),
(27, 'Red Hoodie', 'Munti', 'red', 38,1000, 'Recyclable Paper',1),
(28, 'Olive Hoodie', 'Munti', 'olive', 38,1000, 'Recylable Paper',1),
(29, 'Pink Hoodie', 'Munti', 'pink', 38,1000, 'Recylable Paper',1),
(30, 'Purple Hoodie', 'Munti', 'purple', 38,1000, 'Recylable Paper',1),
(31, 'Black Hoodie', 'Munti', 'black', 38,1000, 'Recylable Paper',1),
(32, 'Burgundy Hoodie', 'Munti', 'burgundy', 38,1000, 'Recylable Paper',1),
(33, 'Navy Blue Hoodie','Munti', 'navy blue', 40, 1000, 'Recyclable Paper',1),
(34, 'Grey Hoodie', 'Munti', 'grey', 40,1000,'Recyclable Paper',1),
(35, 'Red Hoodie', 'Munti', 'red', 40,1000, 'Recyclable Paper',1),
(36, 'Olive Hoodie', 'Munti', 'olive', 40,1000, 'Recylable Paper',1),
(37, 'Pink Hoodie', 'Munti', 'pink', 40,1000, 'Recylable Paper',1),
(38, 'Purple Hoodie', 'Munti', 'purple', 40,1000, 'Recylable Paper',1),
(39, 'Black Hoodie', 'Munti', 'black', 40,1000, 'Recylable Paper',1),
(40, 'Burgundy Hoodie', 'Munti', 'burgundy', 40,1000, 'Recylable Paper',1),
(41, 'Navy Blue Hoodie','Munti', 'navy blue', 42, 1000, 'Recyclable Paper',1),
(42, 'Grey Hoodie', 'Munti', 'grey', 42,1000,'Recyclable Paper',1),
(43, 'Red Hoodie', 'Munti', 'red', 42,1000, 'Recyclable Paper',1),
(44, 'Olive Hoodie', 'Munti', 'olive', 42,1000, 'Recylable Paper',1),
(45, 'Pink Hoodie', 'Munti', 'pink', 42,1000, 'Recylable Paper',1),
(46, 'Purple Hoodie', 'Munti', 'purple', 42,1000, 'Recylable Paper',1),
(47, 'Black Hoodie', 'Munti', 'black', 42,1000, 'Recylable Paper',1),
(48, 'Burgundy Hoodie', 'Munti', 'burgundy', 42,1000, 'Recylable Paper',1),
(49, 'Navy Blue Hoodie','Munti', 'navy blue', 44, 1000, 'Recyclable Paper',1),
(50, 'Grey Hoodie', 'Munti', 'grey', 44,1000,'Recyclable Paper',1),
(51, 'Red Hoodie', 'Munti', 'red', 44,1000, 'Recyclable Paper',1),
(52, 'Olive Hoodie', 'Munti', 'olive', 44,1000, 'Recylable Paper',1),
(53, 'Pink Hoodie', 'Munti', 'pink', 44,1000, 'Recylable Paper',1),
(54, 'Purple Hoodie', 'Munti', 'purple', 44,1000, 'Recylable Paper',1),
(55, 'Black Hoodie', 'Munti', 'black', 44,1000, 'Recylable Paper',1),
(56, 'Burgundy Hoodie', 'Munti', 'burgundy', 44,1000, 'Recylable Paper',1)]

try:
        cur.executemany(qry, valuesinventory)
        conn.commit()
        print ('Records inserted successfully..committed')
except:
        print ('Error in insert operation..rollback')
        conn.rollback()

Records inserted successfully..committed

In [46]:
# Insert multiple records in table E_ORDER

qry="insert into E_ORDER (orderID, orderDate, orderDiscInfo, orderComment, orderStatus, delID) values (?,?,?,?,?,?);"
valuesorder=[(1,'02.01.2022',0.1,'example comment', 'dispatched', 10001),
(2,'02.01.2022',0.2,'example comment', 'dispatched',10002),
(3,'02.01.2022',0.05,'example comment', 'dispatched',10003),
(4,'03.01.2022',0.0,'example comment', 'dispatched',10004),
(5,'03.01.2022',0.0,'example comment', 'dispatched',10005),
(6,'04.01.2022',0.0,'example comment', 'dispatched',10006),
(7,'05.01.2022',0.1,'example comment', 'dispatched',10007),
(8,'06.01.2022',0.05,'example comment', 'dispatched',10008),
(9,'07.01.2022',0.0,'example comment', 'dispatched',10009),
(10,'07.01.2022',0.0,'example comment', 'dispatched',10010),
(11,'07.01.2022',0.0,'example comment', 'dispatched',10011),
(12,'08.01.2022',0.05,'example comment', 'dispatched',10012),
(13,'08.01.2022',0.05,'example comment', 'dispatched',10013),
(14,'09.01.2022',0.05,'example comment', 'dispatched',10014),
(15,'10.01.2022',0.05,'example comment', 'dispatched',10015),
(16,'10.01.2022',0.05,'example comment', 'dispatched',10016),
(17,'10.01.2022',0.05,'example comment', 'dispatched',10017),
(18,'10.01.2022',0.05,'example comment', 'dispatched',10018),
(19,'11.01.2022',0.0,'example comment', 'dispatched',10019),
(20,'12.01.2022',0.1,'example comment', 'dispatched',10020),
(21,'13.01.2022',0.05,'example comment', 'dispatched',10021),
(22,'14.01.2022',0.0,'example comment', 'dispatched',10022),
(23,'15.01.2022',0.0,'example comment', 'dispatched',10023),
(24,'16.01.2022',0.05,'example comment', 'dispatched',10024),
(25,'16.01.2022',0.05,'example comment', 'dispatched',10025),
(26,'17.01.2022',0.05,'example comment', 'dispatched',10026),
(27,'17.01.2022',0.05,'example comment', 'dispatched',10027),
(28,'17.01.2022',0.05,'example comment', 'dispatched',10028),
(29,'18.01.2022',0.05,'example comment', 'dispatched',10029),
(30,'19.01.2022',0.1,'example comment', 'dispatched',10030),
(31,'20.01.2022',0.0,'example comment', 'dispatched',10031),
(32,'21.01.2022',0.05,'example comment', 'dispatched',10032),
(33,'22.01.2022',0.05,'example comment', 'processed',10033),
(34,'23.01.2022',0.05,'example comment', 'processed',10034),
(35,'24.01.2022',0.05,'example comment', 'processed',10035),
(36,'25.01.2022',0.1,'example comment', 'processed',10036),
(37,'25.01.2022',0.05,'example comment', 'processed',10037),
(38,'26.01.2022',0.0,'example comment', 'processed',10038),
(39,'26.01.2022',0.0,'example comment', 'processed',10039),
(40,'27.01.2022',0.0,'example comment', 'processed',10040),
(41,'28.01.2022',0.05,'example comment', 'processed',10041),
(42,'29.01.2022',0.05,'example comment', 'processed',10042),
(43,'30.01.2022',0.0,'example comment', 'processed',10043),
(44,'31.01.2022',0.0,'example comment', 'processed',10044),
(45,'01.02.2022',0.05,'example comment', 'processed',10045),
(46,'02.02.2022',0.05,'example comment', 'processed',10046),
(47,'02.02.2022',0.05,'example comment', 'processed',10047),
(48,'03.02.2022',0.05,'example comment', 'processed',10048),
(49,'03.02.2022',0.05,'example comment', 'processed',10049),
(50,'04.02.2022',0.05,'example comment', 'processed',10050),
(51,'05.02.2022',0.1,'example comment', 'processed',10051),
(52,'06.02.2022',0.05,'example comment', 'processed',10052),
(53,'06.02.2022',0.0,'example comment', 'processed',10053),
(54,'06.02.2022',0.05,'example comment', 'processed',10054),
(55,'07.02.2022',0.05,'example comment', 'processed',10055),
(56,'08.02.2022',0.05,'example comment', 'processed',10056),
(57,'09.02.2022',0.05,'example comment', 'processed',10057),
(58,'09.02.2022',0.0,'example comment', 'processed',10058),
(59,'10.02.2022',0.05,'example comment', 'processed',10059),
(60,'10.02.2022',0.05,'example comment', 'processed',10060),
(61,'11.02.2022',0.05,'example comment', 'received', 10060),
(62,'12.02.2022',0.0,'example comment', 'received', 10059),
(63,'12.02.2022',0.05,'example comment', 'received', 10052),
(64,'13.02.2022',0.05,'example comment', 'received', 10053),
(65,'14.02.2022',0.0,'example comment', 'received', 10055),
(66,'15.02.2022',0.05,'example comment', 'received', 10060),
(67,'16.02.2022',0.05,'example comment', 'received', 10052),
(68,'16.02.2022',0.0,'example comment', 'received', 10056),
(69,'17.02.2022',0.05,'example comment', 'received',10057),
(70,'17.02.2022',0.05,'example comment', 'received', 10060)
]

try:
        cur.executemany(qry, valuesorder)
        conn.commit()
        print ('Records inserted successfully..committed')
except:
        print ('Error in insert operation..rollback')
        conn.rollback()

Records inserted successfully..committed

In [45]:
# Insert multiple records in table E_DELIVERYINFO

qry="insert into E_DELIVERYINFO (delID, custID, courierID) values (?,?,?);"
valuesdelivery=[(10001, 1000, 1),
(10002, 3000, 1),
(10003, 2000, 2),
(10004, 4000, 1),
(10005, 5000, 1),
(10006, 6000, 2),
(10007, 7000, 2),
(10008, 8000, 2),
(10009, 10000, 1),
(10010, 9000, 2),
(10011, 11000, 2),
(10012, 12000, 2),
(10013, 14000, 1),
(10014, 15000, 1),
(10015, 16000, 1),
(10016, 17000, 1),
(10017, 19000, 2),
(10018, 18000, 2),
(10019, 13000, 2),
(10020, 21000, 1),
(10021, 20000, 2),
(10022, 22000, 1),
(10023, 25000, 1),
(10024, 24000, 1),
(10025, 23000, 2),
(10026, 26000, 2),
(10027, 27000, 2),
(10028, 28000, 2),
(10029, 32000, 1),
(10030, 33000, 1),
(10031, 31000, 1),
(10032, 30000, 1),
(10033, 29000, 2),
(10034, 35000, 2),
(10035, 34000, 2),
(10036, 36000, 2),
(10037, 37000, 2),
(10038, 42000, 2),
(10039, 40000, 1),
(10040, 41000, 1),
(10041, 39000, 1),
(10042, 38000, 2),
(10043, 43000, 1),
(10044, 44000, 1),
(10045, 45000, 1),
(10046, 46000, 2),
(10047, 47000, 2),
(10048, 48000, 1),
(10049, 50000, 2),
(10050, 51000, 1),
(10051, 52000, 2),
(10052, 49000, 2),
(10053, 54000, 1),
(10054, 53000, 1),
(10055, 55000, 2),
(10056, 57000, 2),
(10057, 56000, 1),
(10058, 60000, 2),
(10059, 59000, 1),
(10060, 58000, 2)]

try:
        cur.executemany(qry, valuesdelivery)
        conn.commit()
        print ('Records inserted successfully..committed')
except:
        print ('Error in insert operation..rollback')
        conn.rollback()

Records inserted successfully..committed

In [70]:
# Insert multiple records in table E_BILLINGINFO

qry="insert into E_BILLINGINFO (billingID, billingName, billingAddress, billingTransaction, billingDate) values (?,?,?,?,?);"
valuesbilling=[(2000, 'Southampton University', 'Building 85, Highfield Campus University Road, Southampton SO17 1BJ', 'credit card','01.03.2022'),
(3000, 'Cardiff University', 'Park Place, Cardiff CF10 3AT', 'apple pay', '01.03.2022'),
(4000, 'Durham University', 'The Palatine Centre, Stockton Road, Durham DH1 3LE', 'paypal', '01.03.2022'),
(5000, 'Heriot Watt University', 'The Avenue, Edinburgh EH14 4AS', 'credit card', '01.03.2022'),
(6000, 'Keele University', 'Keele Road, Keele ST5 5BG', 'credit card', '01.03.2022'),
(7000, 'Lancaster University', 'Bailrigg, Lancaster LA1 4YX, Lancaster', 'apple pay', '01.03.2022'),
(8000, 'Manchester Metropolitan University', 'All Saints Building, All Saints, Manchester M15 6BH', 'credit card', '01.03.2022'),
(9000, 'Newcastle University', 'Northern Stage, Newcastle Upon Tyne NE1 7RU', 'paypal', '01.03.2022'),
(10000, 'Oxford Brookers University', 'John Radcliffe Hospital, Headley Way, Oxford OX3 9DU', 'credit card', '01.03.2022'),
(11000, 'The University of Manchester', 'Sackville Building, Sackville Street, Manchester M1 3NJ', 'credit card', '01.03.2022'),
(12000, 'University of Chester', 'Parkgate Road, Chester CH1 4BJ', 'credit card', '01.03.2022'),
(13000, 'University of Exeter', 'Stocker Road, Exeter EX4 4PY', 'credit card', '01.03.2022'),
(14000, 'University of Leeds', 'Woodhouse Lane, Leeds LS2 9JT', 'credit card', '01.03.2022'),
(15000, 'University of Westminster', '309 Regent Street, London W1B 2HW', 'credit card', '01.03.2022'),
(16000, 'Sherborne School', 'Abbey Road, Sherborne DT9 3AP', 'paypal', '01.03.2022'),
(17000, 'Abingdon School', 'Park Road, Abingdon OX14 1DE', 'paypal', '01.03.2022'),
(18000, 'St Paul`s Cathedral School', '2 New Change, London EC4M 9AD', 'credit card', '01.03.2022'),
(19000, 'The King`s School, Chester', 'The Kings School Wrexham Road, Chester CH4 7QL','credit card', '01.03.2022'),
(20000, 'Exeter Cathedral School', 'The Chantry, Exeter EX1 1HX', 'credit card', '01.03.2022'),
(21000, 'Oswestry School', 'Upper Brook Street, Oswestry SY11 2TL', 'paypal', '01.03.2022'),
(22000, 'Sevenoaks School', 'High Street, Sevenoaks TN13 1HU', 'apple pay', '01.03.2022'),
(23000, 'Eton College', 'Windsor SL4 6DW', 'credit card', '01.03.2022'),
(24000, 'City of London School', 'Queen Victoria Street, London EC4V 3AL', 'credit card', '01.03.2022'),
(25000, 'Stockport Grammar School', 'Buxton Road, Stockport SK2 7AF', 'apple pay', '01.03.2022'),
(26000, 'Wolverhampton Grammar School', 'Compton Road, Wolverhampton WV3 9RB', 'credit card', '01.03.2022'),
(27000, 'Shrewsbury School', '11 Ashton Road, Shrewsbury SY3 7BA', 'credit card', '01.03.2022' ),
(28000, 'Dolphin School', '25a Bath Buildings, Bristol BS6 5PT', 'paypal', '01.03.2022'),
(29000, 'Colchester High School', 'Wellesley Road, Colchester CO3 3HD', 'apple pay', '01.03.2022' ),
(30000, 'Hydesville Tower School', '25 Broadway North, Walsall WS1 2QG', 'credit card', '01.03.2022' ),
(31000, 'Winchester College', 'Porters Lodge College Street, Winchester SO23 9NA', 'credit card', '01.03.2022'),
(32000, 'Concord College', 'Acton Burnell Hall, Shrewsbury SY5 7PF', 'paypal', '01.03.2022'),
(33000, 'Wycombe Abbey School', 'Wycombe Abbey School Abbey Way, High Wycombe HP11 1PE', 'credit card', '01.03.2022'),
(34000, 'Manchester High School for Girls', 'Grangethorpe Road, Manchester M14 6HS', 'credit card', '01.03.2022'),
(35000, 'Hampton School', 'Hanworth Road, Hampton TW12 3HD', 'apple pay', '01.03.2022'),
(36000, 'Highgate School', 'North Road, London N6 4AY', 'credit card', '01.03.2022'),
(37000, 'Godolphin & Latymer School', 'Godolphin Caretakers Lodge Iffley Road, Hammersmith W6 0PG', 'credit card', '01.03.2022'),
(38000, 'Merchant Taylors` School', 'Sandy Lodge, Rickmansworth HA6 2HT', 'apple pay', '01.03.2022'),
(39000, 'Loughborough High School', '3 Burton Walks, Loughborough LE11 2DU', 'credit card', '01.03.2022'),
(40000, 'Uppingham School', '20-24 High Street West, Uppingham LE15 9QE', 'credit card', '01.03.2022'),
(41000, 'Radley College', 'Radley College Radley, Abingdon OX14 2HR', 'paypal', '01.03.2022'),
(42000, 'Cheltenham Ladies` College', 'Bayshill Road, Cheltenham GL50 3EP', 'credit card', '01.03.2022'),
(43000, 'St Albans School', 'Abbey Gateway, St Albans AL3 4HB', 'paypal', '01.03.2022'),
(44000, 'Caterham School', 'Caterham School Harestone Valley Road, Caterham CR3 6YA', 'credit card', '01.03.2022'),
(45000, 'Latymer Upper School', '237 King Street, London W6 9LR', 'credit card', '01.03.2022'),
(46000, 'Wellington College', 'Wellington College Duke`s Ride CROWTHORNE Berkshire RG45 7PU', 'paypal', '01.03.2022'),
(47000, 'Francis Holland School', '39 Graham Terrace, London SW1W 8JF', 'credit card', '01.03.2022'),
(48000, 'Mayfield', 'High Street, The Old Palace, Mayfield TN20 6PH', 'credit card', '01.03.2022'),
(49000, 'Canford School', 'Wimborne Minster BH21 3AD', 'credit card', '01.03.2022'),
(50000, 'Wembley High Technology College', '2 Oldborough Road, Wembley HA0 3NT', 'apple pay', '01.03.2022'),
(51000, 'The Tiffin Girls School', 'Richmond Rd, London KT2 5PL', 'paypal', '01.03.2022'),
(52000, 'Magna Academy', 'Ashdown Leisure Centre Adastral Road, Poole BH17 8RE', 'paypal', '01.03.2022'),
(53000, 'The Holy Cross School', 'Dean Lane, Bristol BS3 1DB', 'credit card', '01.03.2022'),
(54000, 'Dartford Grammar School for Girls', '65 Shepherds Lane, Dartford DA1 2NT', 'credit card', '01.03.2022'),
(55000, 'London Academy', 'Spur Road, Edgware, London HA8 8DE', 'paypal', '01.03.2022'),
(56000, 'St Augustine`s Catholic High School', 'Stonepits Ln, Redditch B97 5LX', 'apple pay', '01.03.2022'),
(57000, 'Sacred Heart Catholic School', 'Camberwell New Road, London SE5 0RP', 'credit card', '01.03.2022'),
(58000, 'Beacon Academy', 'North Beeches Road, Crowborough TN6 2AS', 'paypal', '01.03.2022'),
(59000, 'Featherstone High School', '11 Montague Waye, Southall UB2 5HF', 'credit card', '01.03.2022'),
(60000,'Manor High School', '3 Severn Road, Oadby LE2 4FU', 'credit card', '01.03.2022')]

try:
        cur.executemany(qry, valuesbilling)
        conn.commit()
        print ('Records inserted successfully..committed')
except:
        print ('Error in insert operation..rollback')
        conn.rollback()

Records inserted successfully..committed

In [69]:
qry="insert into  E_BILLINGINFO values (1000,'Bath Spa University', 'Newton Park, Newton St Loe, Bath BA2 9BN', 'credit card','01.03.2022');"

try:
        cur.execute(qry)
        conn.commit()
        print ('One record inserted successfully..commit')
except:
        print ('Error in insert operation..rollback')
        conn.rollback()
        print(conn)

One record inserted successfully..commit

In [71]:
# Insert multiple records in table E_COURIER

qry="insert into E_COURIER (courierID, courierName, courierPhone, courierEmail) values (?,?,?,?);"
valuescourier=[(1, 'DPD', 1179105010, 'deliveries@dpd.com'),
(2, 'Royal Mail', 3457740740, 'deliveries@royalmail.com')]

try:
        cur.executemany(qry, valuescourier)
        conn.commit()
        print ('Records inserted successfully..committed')
except:
        print ('Error in insert operation..rollback')
        conn.rollback()

Records inserted successfully..committed

In [99]:
# Insert multiple records in table E_CUSTOMER

qry="insert into E_CUSTOMER (custID, custName, custAddress, custEmail, custPhone, billingID) values (?,?,?,?,?,?);"
valuescustomer=[(3000, 'Cardiff University', 'Park Place, Cardiff CF10 3AT', 'office@cardiff.ac.uk', 2920874000,3000),
(4000, 'Durham University', 'The Palatine Centre, Stockton Road, Durham DH1 3LE', 'services@durham.ac.uk', 1913342000,4000),
(5000, 'Heriot Watt University', 'The Avenue, Edinburgh EH14 4AS', 'info@hw.ac.uk', 1314495111,5000),
(6000, 'Keele University', 'Keele Road, Keele ST5 5BG', 'reception@keele.ac.uk', 1782733937,6000)]

try:
        cur.executemany(qry, valuescustomer)
        conn.commit()
        print ('Records inserted successfully..committed')
except:
        print ('Error in insert operation..rollback')
        conn.rollback()

Records inserted successfully..committed

In [75]:
qry="insert into E_CUSTOMER values (1000,'Bath Spa University', 'Newton Park, Newton St Loe, Bath BA2 9BN', 'maindesk@bathspa.ac.uk', 1225875875,1000);"

try:
        cur.execute(qry)
        conn.commit()
        print ('One record inserted successfully..commit')
except:
        print ('Error in insert operation..rollback')
        conn.rollback()
        print(conn)

One record inserted successfully..commit

In [102]:
qry="insert into E_CUSTOMER values (2000,'Southampton University', 'Highfield Campus University Road, Southampton SO17 1BJ', 'admin@southampton.ac.uk', 1225785875,2000);"

try:
        cur.execute(qry)
        conn.commit()
        print ('One record inserted successfully..commit')
except:
        print ('Error in insert operation..rollback')
        conn.rollback()
        print(conn)

One record inserted successfully..commit

In [123]:
# Insert multiple records in table E_CUSTOMER

qry="insert into E_CUSTOMER (custID, custName, custAddress, custEmail, custPhone, billingID) values (?,?,?,?,?,?);"
valuescustomer=[(7000,'Lancaster University', 'Bailrigg, Lancaster LA1 4YX, Lancaster', 'info@lancaster.ac.uk',152459028,7000),
(8000,'Manchester Metropolitan University', 'All Saints Building, All Saints, Manchester M15 6BH', 'office@mmu.ac.uk',1612472186,8000),
(9000,'Newcastle University', 'Northern Stage, Newcastle Upon Tyne NE1 7RU', 'admin@ncl.ac.uk',1912086000,9000),
(10000,'Oxford Brookers University', 'John Radcliffe Hospital, Headley Way, Oxford OX3 9DU','admin@brookes.ac.uk',1865484848,10000),
(11000,'The University of Manchester', 'Sackville Building, Sackville Street, Manchester M1 3NJ','admin@manchester.ac.uk',1612732996,11000),
(12000, 'University of Chester', 'Parkgate Road, Chester CH1 4BJ', 'helpdesk@chester.ac.uk',1244511000,12000),
(13000, 'University of Exeter', 'Stocker Road, Exeter EX4 4PY', 'info@exeter.ac.uk',1392661000,13000),
(14000, 'University of Leeds', 'Woodhouse Lane, Leeds LS2 9JT', 'info@leeds.ac.uk',1132431751,14000),
(15000, 'University of Westminster', '309 Regent Street, London W1B 2HW', 'admin@westminster.ac.uk',2079115000,15000),
(16000, 'Sherborne School', 'Abbey Road, Sherborne DT9 3AP', 'enquiries@sherborne.org',1935812249,16000),
(17000, 'Abingdon School', 'Park Road, Abingdon OX14 1DE', 'reception@abingdon.org.uk',1235521563,17000),
(18000, 'St Paul`s Cathedral School', '2 New Change, London EC4M 9AD', 'admin@spcs@london.sch.uk',2072485156,18000),
(19000, 'The King`s School, Chester', 'The Kings School Wrexham Road, Chester CH4 7QL','office@kingschester.co.uk',1244689500,19000),
(20000, 'Exeter Cathedral School', 'The Chantry, Exeter EX1 1HX', 'reception@exetercs.org',1392255298,20000)]

try:
        cur.executemany(qry, valuescustomer)
        conn.commit()
        print ('Records inserted successfully..committed')
except:
        print ('Error in insert operation..rollback')
        conn.rollback()

Records inserted successfully..committed

In [125]:
# Insert multiple records in table E_CUSTOMER

qry="insert into E_CUSTOMER (custID, custName, custAddress, custEmail, custPhone, billingID) values (?,?,?,?,?,?);"
valuescustomer=[(21000, 'Oswestry School', 'Upper Brook Street, Oswestry SY11 2TL', 'admin@oswestryschool.com',1691655711,21000),
(22000, 'Sevenoaks School', 'High Street, Sevenoaks TN13 1HU', 'admin@sevenoaksschool.org',1732467703,22000),
(23000, 'Eton College', 'Windsor SL4 6DW', 'enquiries@etoncollege.org.uk',1753370100,23000),
(24000, 'City of London School', 'Queen Victoria Street, London EC4V 3AL', 'officr@cityoflondonschool.org.uk',2036806314,24000),
(25000, 'Stockport Grammar School', 'Buxton Road, Stockport SK2 7AF', 'sgs@stockportgrammar.co.uk',1614569000,25000),
(26000, 'Wolverhampton Grammar School', 'Compton Road, Wolverhampton WV3 9RB', 'office@wgs-sch.net',1902421326,26000),
(27000, 'Shrewsbury School', '11 Ashton Road, Shrewsbury SY3 7BA', 'reception@shrewsbury.org.uk',1743280500,27000),
(28000, 'Dolphin School', '25a Bath Buildings, Bristol BS6 5PT', 'receptionist@dolphinschool.org.uk',2079243472,28000),
(29000, 'Colchester High School', 'Wellesley Road, Colchester CO3 3HD', 'info@colchesterhighschool.co.uk',1206217116,29000),
(30000, 'Hydesville Tower School', '25 Broadway North, Walsall WS1 2QG', 'info@hydesville.com',1922624374,30000),
(31000, 'Winchester College', 'Porters Lodge College Street, Winchester SO23 9NA', 'wincolloffice@wincoll.ac.uk',1962621100,31000),
(32000, 'Concord College', 'Acton Burnell Hall, Shrewsbury SY5 7PF', 'office@concordcollege.org.uk',1694731631,32000),
(33000, 'Wycombe Abbey School', 'Wycombe Abbey School Abbey Way, High Wycombe HP11 1PE', 'office@wycombeabbey.com',1494520381,33000),
(34000, 'Manchester High School for Girls', 'Grangethorpe Road, Manchester M14 6HS', 'administration@mhsg.manchester.sch.uk',1612240447,34000),
(35000, 'Hampton School', 'Hanworth Road, Hampton TW12 3HD', 'info@hamptonschool.org.uk',2089795526,35000),
(36000, 'Highgate School', 'North Road, London N6 4AY', 'communications@highgateschool.org.uk',2083401524,36000),
(37000, 'Godolphin & Latymer School', 'Godolphin Caretakers Lodge Iffley Road, Hammersmith W6 0PG', 'office@godolphinandlatymer.com',2087411936,37000),
(38000, 'Merchant Taylors` School', 'Sandy Lodge, Rickmansworth HA6 2HT', 'infomtgs@merchanttaylors.com',1923820644,38000),
(39000, 'Loughborough High School', '3 Burton Walks, Loughborough LE11 2DU', 'office@lhs.com',1509212348,39000),
(40000, 'Uppingham School', '20-24 High Street West, Uppingham LE15 9QE', 'pa@uppingham.co.uk',1572822216,40000),
(41000, 'Radley College', 'Radley College Radley, Abingdon OX14 2HR', 'office@radley.org.uk',1235543174,41000),
(42000, 'Cheltenham Ladies` College', 'Bayshill Road, Cheltenham GL50 3EP', 'enquiries@cheltladiescollege.org',1242520691,42000),
(43000, 'St Albans School', 'Abbey Gateway, St Albans AL3 4HB', 'office@stalbanssch.org.uk',1727855521,43000),
(44000, 'Caterham School', 'Caterham School Harestone Valley Road, Caterham CR3 6YA', 'pa@caterhamschool.co.uk',1883343028,44000),
(45000, 'Latymer Upper School', '237 King Street, London W6 9LR', 'office@latymer-upper.org.',2086292024,45000),
(46000, 'Wellington College', 'Wellington College Duke`s Ride CROWTHORNE Berkshire RG45 7PU', 'office@wellingtoncollege.org.uk',1344444000,46000),
(47000, 'Francis Holland School', '39 Graham Terrace, London SW1W 8JF', 'office@fhs.com',2077308359,47000),
(48000, 'Mayfield', 'High Street, The Old Palace, Mayfield TN20 6PH', 'enquiry@mayfiled.org',1435874600,48000),
(49000, 'Canford School', 'Wimborne Minster BH21 3AD', 'office@canford.com',1202847207,49000),
(50000, 'Wembley High Technology College', '2 Oldborough Road, Wembley HA0 3NT', 'admin@whtc.co.uk',2083854800,50000),
(51000, 'The Tiffin Girls School', 'Richmond Rd, London KT2 5PL', 'contact@tiffingirls.org',2085460773,51000),
(52000, 'Magna Academy', 'Ashdown Leisure Centre Adastral Road, Poole BH17 8RE', 'office@magna-aspirations.org',1202604222,52000),
(53000, 'The Holy Cross School', 'Dean Lane, Bristol BS3 1DB', 'hxs@holycross.kingston.sch.uk',1173772199,53000),
(54000, 'Dartford Grammar School for Girls', '65 Shepherds Lane, Dartford DA1 2NT', 'info@dartfordgrammarschool.org.uk',1322223123,54000),
(55000, 'London Academy', 'Spur Road, Edgware, London HA8 8DE', 'office@londonacademy.org.uk',2082381100,55000),
(56000, 'St Augustine`s Catholic High School', 'Stonepits Ln, Redditch B97 5LX', 'reception@sta.magnificat.org.uk',1527550400,56000),
(57000, 'Sacred Heart Catholic School', 'Camberwell New Road, London SE5 0RP', 'office@sacredheart.southwark.sch.uk',2072746844,57000),
(58000, 'Beacon Academy', 'North Beeches Road, Crowborough TN6 2AS', 'office@beaconacademy.co.uk',1472328888,58000),
(59000, 'Featherstone High School', '11 Montague Waye, Southall UB2 5HF', 'info@featherstonehigh.ealing.sch.uk',2088430984,59000),
(60000,'Manor High School', '3 Severn Road, Oadby LE2 4FU', 'admin@oaktrust.org',1162714941,60000)]

try:
        cur.executemany(qry, valuescustomer)
        conn.commit()
        print ('Records inserted successfully..committed')
except:
        print ('Error in insert operation..rollback')
        conn.rollback()

Records inserted successfully..committed

In [131]:
# Insert multiple records in table E_ORD_INV

qry="insert into E_ORD_INV (orderID, invID) values (?,?);"
valuesordinv=[(1,10),
(1,56),
(2,10),
(2,56),
(2,29),
(3,42),
(3,41),
(3,23),
(3,34),
(3,37),
(4,40),
(4,34),
(5,28),
(5,33),
(6,22),
(7,32),
(7,38),
(7,10),
(7,43),
(8,26),
(9,5),
(10,45)]

try:
        cur.executemany(qry, valuesordinv)
        conn.commit()
        print ('Records inserted successfully..committed')
except:
        print ('Error in insert operation..rollback')
        conn.rollback()

Records inserted successfully..committed

In [138]:
qry="insert into E_ORD_INV (orderID, invID) values (?,?);"
valuesordinv=[(10,25),
(11,25),
(11,45),
(11,6),
(11,38),
(12,31),
(12,37),
(12,9),
(12,29),
(13,17),
(13,29),
(13,27),
(14,31),
(14,48),
(14,36),
(14,51),
(15,16),
(15,54),
(16,20),
(17,11),]

try:
        cur.executemany(qry, valuesordinv)
        conn.commit()
        print ('Records inserted successfully..committed')
except:
        print ('Error in insert operation..rollback')
        conn.rollback()

Records inserted successfully..committed

In [140]:
qry="insert into E_ORD_INV (orderID, invID) values (?,?);"
valuesordinv=[(18,15),
(18,21),
(18,22),
(19,16),
(19,42),
(20,52),
(20,49),
(21,31),
(21,35),
(21,47),
(22,5),
(23,3),
(24,9),
(24,28),
(25,50),
(25,11),
(26,12),
(27,43),
(27,23),
(27,28),
(27,39),
(28,14),
(29,36),
(29,37),
(30,36),
(31,48),
(32,20),
(32,7),
(32,44),
(33,10),
(34,50),
(34,21),
(34,34),
(35,24),
(36,31),
(37,35),
(37,13),
(38,32),
(39,25),
(39,22),
(40,34),
(41,26),
(41,51),
(42,18),
(43,27),
(44,30),
(45,10),
(46,37),
(47,51),
(47,27),
(47,36),
(48,3),
(49,11),
(50,20),
(50,54),
(51,55),
(51,3),
(52,47),
(53,42),
(54,14),
(55,14),
(56,45),
(56,32),
(56,24),
(57,16),
(58,25),
(59,52),
(59,20),
(59,41),
(60,20),
(61,48),
(62,41),
(63,19),
(63,8),
(63,9),
(64,40),
(65,31),
(66,44),
(67,56),
(68,19),
(69,23),
(69,31),
(70,12),
(70,16)]

try:
        cur.executemany(qry, valuesordinv)
        conn.commit()
        print ('Records inserted successfully..committed')
except:
        print ('Error in insert operation..rollback')
        conn.rollback()

Records inserted successfully..committed

In [129]:
qry="insert into E_ORD_INV values (1,4);"

try:
        cur.execute(qry)
        conn.commit()
        print ('One record inserted successfully..commit')
except:
        print ('Error in insert operation..rollback')
        conn.rollback()
        print(conn)

One record inserted successfully..commit

In [27]:
conn.close()

In [5]:
qry="select * from E_INVENTORY;"
cur.execute(qry)

# Fetch and display one row
row=cur.fetchone()

print (row)

(1, 'Navy Blue Hoodie', 'Munti', 'navy blue', 32, 1000, 'Recyclable Paper', 1)

In [13]:
# Query and display all records from the table E_INVENTORY

# Prepare the query String
qry="select * from E_INVENTORY;"

# Execute query on SQLite
cur.execute(qry)

# Fetch and display one row

rows=cur.fetchall()
for row in rows:
    print (row)

(1, 'Navy Blue Hoodie', 'Munti', 'navy blue', 32, 1000, 'Recyclable Paper', 1)
(2, 'Grey Hoodie', 'Munti', 'grey', 32, 1000, 'Recyclable Paper', 1)
(3, 'Red Hoodie', 'Munti', 'red', 32, 1000, 'Recyclable Paper', 1)
(4, 'Olive Hoodie', 'Munti', 'olive', 32, 1000, 'Recylable Paper', 1)
(5, 'Pink Hoodie', 'Munti', 'pink', 32, 1000, 'Recylable Paper', 1)
(6, 'Purple Hoodie', 'Munti', 'purple', 32, 1000, 'Recylable Paper', 1)
(7, 'Black Hoodie', 'Munti', 'black', 32, 1000, 'Recylable Paper', 1)
(8, 'Burgundy Hoodie', 'Munti', 'burgundy', 32, 1000, 'Recylable Paper', 1)
(9, 'Navy Blue Hoodie', 'Munti', 'navy blue', 34, 1000, 'Recyclable Paper', 1)
(10, 'Grey Hoodie', 'Munti', 'grey', 34, 1000, 'Recyclable Paper', 1)
(11, 'Red Hoodie', 'Munti', 'red', 34, 1000, 'Recyclable Paper', 1)
(12, 'Olive Hoodie', 'Munti', 'olive', 34, 1000, 'Recylable Paper', 1)
(13, 'Pink Hoodie', 'Munti', 'pink', 34, 1000, 'Recylable Paper', 1)
(14, 'Purple Hoodie', 'Munti', 'purple', 34, 1000, 'Recylable Paper', 1)
(15, 'Black Hoodie', 'Munti', 'black', 34, 1000, 'Recylable Paper', 1)
(16, 'Burgundy Hoodie', 'Munti', 'burgundy', 34, 1000, 'Recylable Paper', 1)
(17, 'Navy Blue Hoodie', 'Munti', 'navy blue', 36, 1000, 'Recyclable Paper', 1)
(18, 'Grey Hoodie', 'Munti', 'grey', 36, 1000, 'Recyclable Paper', 1)
(19, 'Red Hoodie', 'Munti', 'red', 36, 1000, 'Recyclable Paper', 1)
(20, 'Olive Hoodie', 'Munti', 'olive', 36, 1000, 'Recylable Paper', 1)
(21, 'Pink Hoodie', 'Munti', 'pink', 36, 1000, 'Recylable Paper', 1)
(22, 'Purple Hoodie', 'Munti', 'purple', 36, 1000, 'Recylable Paper', 1)
(23, 'Black Hoodie', 'Munti', 'black', 36, 1000, 'Recylable Paper', 1)
(24, 'Burgundy Hoodie', 'Munti', 'burgundy', 36, 1000, 'Recylable Paper', 1)
(25, 'Navy Blue Hoodie', 'Munti', 'navy blue', 38, 1000, 'Recyclable Paper', 1)
(26, 'Grey Hoodie', 'Munti', 'grey', 38, 1000, 'Recyclable Paper', 1)
(27, 'Red Hoodie', 'Munti', 'red', 38, 1000, 'Recyclable Paper', 1)
(28, 'Olive Hoodie', 'Munti', 'olive', 38, 1000, 'Recylable Paper', 1)
(29, 'Pink Hoodie', 'Munti', 'pink', 38, 1000, 'Recylable Paper', 1)
(30, 'Purple Hoodie', 'Munti', 'purple', 38, 1000, 'Recylable Paper', 1)
(31, 'Black Hoodie', 'Munti', 'black', 38, 1000, 'Recylable Paper', 1)
(32, 'Burgundy Hoodie', 'Munti', 'burgundy', 38, 1000, 'Recylable Paper', 1)
(33, 'Navy Blue Hoodie', 'Munti', 'navy blue', 40, 1000, 'Recyclable Paper', 1)
(34, 'Grey Hoodie', 'Munti', 'grey', 40, 1000, 'Recyclable Paper', 1)
(35, 'Red Hoodie', 'Munti', 'red', 40, 1000, 'Recyclable Paper', 1)
(36, 'Olive Hoodie', 'Munti', 'olive', 40, 1000, 'Recylable Paper', 1)
(37, 'Pink Hoodie', 'Munti', 'pink', 40, 1000, 'Recylable Paper', 1)
(38, 'Purple Hoodie', 'Munti', 'purple', 40, 1000, 'Recylable Paper', 1)
(39, 'Black Hoodie', 'Munti', 'black', 40, 1000, 'Recylable Paper', 1)
(40, 'Burgundy Hoodie', 'Munti', 'burgundy', 40, 1000, 'Recylable Paper', 1)
(41, 'Navy Blue Hoodie', 'Munti', 'navy blue', 42, 1000, 'Recyclable Paper', 1)
(42, 'Grey Hoodie', 'Munti', 'grey', 42, 1000, 'Recyclable Paper', 1)
(43, 'Red Hoodie', 'Munti', 'red', 42, 1000, 'Recyclable Paper', 1)
(44, 'Olive Hoodie', 'Munti', 'olive', 42, 1000, 'Recylable Paper', 1)
(45, 'Pink Hoodie', 'Munti', 'pink', 42, 1000, 'Recylable Paper', 1)
(46, 'Purple Hoodie', 'Munti', 'purple', 42, 1000, 'Recylable Paper', 1)
(47, 'Black Hoodie', 'Munti', 'black', 42, 1000, 'Recylable Paper', 1)
(48, 'Burgundy Hoodie', 'Munti', 'burgundy', 42, 1000, 'Recylable Paper', 1)
(49, 'Navy Blue Hoodie', 'Munti', 'navy blue', 44, 1000, 'Recyclable Paper', 1)
(50, 'Grey Hoodie', 'Munti', 'grey', 44, 1000, 'Recyclable Paper', 1)
(51, 'Red Hoodie', 'Munti', 'red', 44, 1000, 'Recyclable Paper', 1)
(52, 'Olive Hoodie', 'Munti', 'olive', 44, 1000, 'Recylable Paper', 1)
(53, 'Pink Hoodie', 'Munti', 'pink', 44, 1000, 'Recylable Paper', 1)
(54, 'Purple Hoodie', 'Munti', 'purple', 44, 1000, 'Recylable Paper', 1)
(55, 'Black Hoodie', 'Munti', 'black', 44, 1000, 'Recylable Paper', 1)
(56, 'Burgundy Hoodie', 'Munti', 'burgundy', 44, 1000, 'Recylable Paper', 1)

In [6]:
# Query and display records from the table E_INVENTORY based on user input

inputE_InventoryID=input ('Enter E_INVENTORY ID:')
qry="select * from E_INVENTORY where invID=?";
cur.execute(qry, (inputE_InventoryID,))
row=cur.fetchone()
print (row)

# IMPORTANT: Individual items in the tuple can be accessed by index .. we are accessing the second attribute
print ("Customer Name is ", row[1])

Enter E_INVENTORY ID:4
(4, 'Olive Hoodie', 'Munti', 'olive', 32, 1000, 'Recylable Paper', 1)
Customer Name is  Olive Hoodie

In [14]:
# Query and display records from the table E_Customer based on user input

inputCustomerName=input ('Enter E_Customer Name:')
qry="select * from E_CUSTOMER where custName=?";
cur.execute(qry, (inputCustomerName,))
row=cur.fetchone()
print (row)

# IMPORTANT: Individual items in the tuple can be accessed by index .. we are accessing the second attribute
print ("Department Name is ", row[1])

Enter E_Customer Name:Sevenoaks School
(22000, 'Sevenoaks School', 'High Street, Sevenoaks TN13 1HU', 'admin@sevenoaksschool.org', 1732467703, 22000)
Department Name is  Sevenoaks School

In [9]:
# Update table based on user input

inputName=input('Enter name of E_Customer to update:')
inputCustomerNum=int(input('Enter new customer number:'))
qry='update E_CUSTOMER set custID=? where custName=?'

try:
        cur.execute(qry, (inputCustomerNum,inputName))
        print ('Customer name updated')
        conn.commit()
except:
        print ('Error in update operation .. rollback')
        conn.rollback()

Enter name of E_Customer to update:Sevenoaks School
Enter new customer number:22000
Customer name updated

In [10]:
# Query and display records from the table E_Customer based on user input

inputCustomerName=input ('Enter E_Customer Name:')
qry="select * from E_CUSTOMER where custName=?";
cur.execute(qry, (inputCustomerName,))
row=cur.fetchone()
print (row)

# IMPORTANT: Individual items in the tuple can be accessed by index .. we are accessing the second attribute
print ("Department Name is ", row[1])

Enter E_Customer Name:Sevenoaks School
(22000, 'Sevenoaks School', 'High Street, Sevenoaks TN13 1HU', 'admin@sevenoaksschool.org', 1732467703, 22000)
Department Name is  Sevenoaks School

In [11]:
# Delete record based on user input

inputName=input('Enter name of E_Customer to delete:')
qry='delete from E_CUSTOMER where custName=?'
try:
        cur.execute(qry, (inputName,))
        print ('Customer deleted')
        conn.commit()
except:
        print ('Error in deleting department', inputName)
        conn.rollback()

Enter name of E_Customer to delete:Manor High School
Customer deleted

In [12]:
qry="insert into E_CUSTOMER values (60000,'Manor High School', '3 Severn Road, Oadby LE2 4FU', 'admin@oaktrust.org',1162714941,60000);"

try:
        cur.execute(qry)
        conn.commit()
        print ('One record inserted successfully..commit')
except:
        print ('Error in insert operation..rollback')
        conn.rollback()
        print(conn)

One record inserted successfully..commit